<a href="https://colab.research.google.com/github/oktaviacitra/data-mining/blob/main/Assignment4.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Import Libraries

In [ ]:
import pandas as pd
import numpy as np
from sklearn.neighbors import KNeighborsClassifier

# Upload A File

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

# Read Dataset

## Train

In [ ]:
path = "/content/drive/MyDrive/Data Mining/"
train_dataset = pd.read_csv(path + "titanic.csv")
train_dataset.head(10)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S
5            6         0       3  ...   8.4583   NaN         Q
6            7         0       1  ...  51.8625   E46         S
7            8         0       3  ...  21.0750   NaN         S
8            9         1       3  ...  11.1333   NaN         S
9           10         1       2  ...  30.0708   NaN         C

[10 rows x 12 columns]

## Test

In [ ]:
test_dataset = pd.read_csv(path + "titanic_test.csv")
test_dataset.head(10)

   PassengerId  Pclass  ... Cabin Embarked
0          892       3  ...   NaN        Q
1          893       3  ...   NaN        S
2          894       2  ...   NaN        Q
3          895       3  ...   NaN        S
4          896       3  ...   NaN        S
5          897       3  ...   NaN        S
6          898       3  ...   NaN        Q
7          899       2  ...   NaN        S
8          900       3  ...   NaN        C
9          901       3  ...   NaN        S

[10 rows x 11 columns]

# Preprocessing

## Train

### Take Some of The Necessary Features

In [ ]:
train_data = train_dataset.loc[:, ['Age', 'Fare']]
train_data.head(10)

    Age     Fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500
5   NaN   8.4583
6  54.0  51.8625
7   2.0  21.0750
8  27.0  11.1333
9  14.0  30.0708

### Get Indexes of Rows with Missing Values in Column

In [ ]:
pos_missing_train = [index for index, row in train_data.iterrows() if row.isnull().any()]
pos_missing_train

[5,
 17,
 19,
 26,
 28,
 29,
 31,
 32,
 36,
 42,
 45,
 46,
 47,
 48,
 55,
 64,
 65,
 76,
 77,
 82,
 87,
 95,
 101,
 107,
 109,
 121,
 126,
 128,
 140,
 154,
 158,
 159,
 166,
 168,
 176,
 180,
 181,
 185,
 186,
 196,
 198,
 201,
 214,
 223,
 229,
 235,
 240,
 241,
 250,
 256,
 260,
 264,
 270,
 274,
 277,
 284,
 295,
 298,
 300,
 301,
 303,
 304,
 306,
 324,
 330,
 334,
 335,
 347,
 351,
 354,
 358,
 359,
 364,
 367,
 368,
 375,
 384,
 388,
 409,
 410,
 411,
 413,
 415,
 420,
 425,
 428,
 431,
 444,
 451,
 454,
 457,
 459,
 464,
 466,
 468,
 470,
 475,
 481,
 485,
 490,
 495,
 497,
 502,
 507,
 511,
 517,
 522,
 524,
 527,
 531,
 533,
 538,
 547,
 552,
 557,
 560,
 563,
 564,
 568,
 573,
 578,
 584,
 589,
 593,
 596,
 598,
 601,
 602,
 611,
 612,
 613,
 629,
 633,
 639,
 643,
 648,
 650,
 653,
 656,
 667,
 669,
 674,
 680,
 692,
 697,
 709,
 711,
 718,
 727,
 732,
 738,
 739,
 740,
 760,
 766,
 768,
 773,
 776,
 778,
 783,
 790,
 792,
 793,
 815,
 825,
 826,
 828,
 832,
 837,
 839,
 846,
 849,
 859,
 863,
 868,
 878,
 888]

### Drop Rows with Missing Values in Column

In [ ]:
train_data = train_data.dropna()
train_data.head(10)

     Age     Fare
0   22.0   7.2500
1   38.0  71.2833
2   26.0   7.9250
3   35.0  53.1000
4   35.0   8.0500
6   54.0  51.8625
7    2.0  21.0750
8   27.0  11.1333
9   14.0  30.0708
10   4.0  16.7000

## Test

### Take Some of The Necessary Features

In [ ]:
test_data = test_dataset.loc[:, ['Age', 'Fare']]
test_data.tail(10)

      Age      Fare
408   NaN    7.7208
409   3.0   13.7750
410   NaN    7.7500
411  37.0   90.0000
412  28.0    7.7750
413   NaN    8.0500
414  39.0  108.9000
415  38.5    7.2500
416   NaN    8.0500
417   NaN   22.3583

### Get Indexes of Rows with Missing Values in Column

In [ ]:
pos_missing_test = [index for index, row in test_data.iterrows() if row.isnull().any()]
pos_missing_test

[10,
 22,
 29,
 33,
 36,
 39,
 41,
 47,
 54,
 58,
 65,
 76,
 83,
 84,
 85,
 88,
 91,
 93,
 102,
 107,
 108,
 111,
 116,
 121,
 124,
 127,
 132,
 133,
 146,
 148,
 151,
 152,
 160,
 163,
 168,
 170,
 173,
 183,
 188,
 191,
 199,
 200,
 205,
 211,
 216,
 219,
 225,
 227,
 233,
 243,
 244,
 249,
 255,
 256,
 265,
 266,
 267,
 268,
 271,
 273,
 274,
 282,
 286,
 288,
 289,
 290,
 292,
 297,
 301,
 304,
 312,
 332,
 339,
 342,
 344,
 357,
 358,
 365,
 366,
 380,
 382,
 384,
 408,
 410,
 413,
 416,
 417]

### Drop Rows with Missing Values in Column

In [ ]:
test_data = test_data.dropna()
test_data.tail(10)

      Age      Fare
403  17.0   47.1000
404  43.0   27.7208
405  20.0   13.8625
406  23.0   10.5000
407  50.0  211.5000
409   3.0   13.7750
411  37.0   90.0000
412  28.0    7.7750
414  39.0  108.9000
415  38.5    7.2500

# Create A Variable to Hold The Label

## Train

In [ ]:
train_label = train_dataset.loc[:, ['Survived']].drop(pos_missing_train)
train_label.head(10)

    Survived
0          0
1          1
2          1
3          1
4          0
6          0
7          0
8          1
9          1
10         1

## Test

In [ ]:
test_label = pd.read_csv(path + "titanic_testlabel.csv").loc[:, ['Survived']].drop(pos_missing_test)
test_label.tail(10)

     Survived
403         0
404         0
405         0
406         0
407         0
409         1
411         1
412         1
414         1
415         0

# Data Normalization

## Train

In [ ]:
new_min, new_max = 0, 1
new_min_max = []
for column in train_data.columns:
  data = train_data[column]
  min = data.min()
  max = data.max()
  new_min_max.append([min, max])
  train_data[column] = (data - min) * (new_max - new_min) / (max - min) + new_min
train_data

          Age      Fare
0    0.271174  0.014151
1    0.472229  0.139136
2    0.321438  0.015469
3    0.434531  0.103644
4    0.434531  0.015713
..        ...       ...
885  0.484795  0.056848
886  0.334004  0.025374
887  0.233476  0.058556
889  0.321438  0.058556
890  0.396833  0.015127

[714 rows x 2 columns]

## Test

In [ ]:
i = 0
for column in test_data.columns:
  data = test_data[column]
  min = new_min_max[i][0]
  max = new_min_max[i][1]
  test_data[column] = (data - min) * (new_max - new_min) / (max - min) + new_min
  i += 1
test_data

          Age      Fare
0    0.428248  0.015282
1    0.585323  0.013663
2    0.773813  0.018909
3    0.334004  0.016908
4    0.271174  0.023984
..        ...       ...
409  0.032420  0.026887
411  0.459663  0.175668
412  0.346569  0.015176
414  0.484795  0.212559
415  0.478512  0.014151

[331 rows x 2 columns]

# Classification using k-Nearest Neighbors

In [ ]:
kNN = KNeighborsClassifier(n_neighbors=5, weights='distance')
kNN.fit(train_data, train_label)
class_result = kNN.predict(test_data)
class_result

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:2: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().

array([0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 1, 0, 1, 0, 1,
       1, 0, 1, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0,
       1, 1, 0, 0, 0, 1, 1, 1, 0, 1, 1, 0, 0, 1, 1, 0, 0, 1, 1, 1, 1, 0,
       0, 0, 1, 1, 1, 0, 1, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 1, 0, 1, 0, 1, 1, 1, 1, 1, 0, 0, 0, 1, 0, 1, 1, 0, 0, 1, 0,
       0, 1, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 1, 0, 0, 0,
       1, 1, 0, 1, 1, 1, 0, 0, 1, 0, 1, 0, 1, 0, 1, 1, 1, 1, 1, 0, 1, 0,
       0, 0, 1, 0, 0, 1, 1, 1, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 1, 1, 0, 0,
       0, 1, 1, 0, 0, 1, 1, 1, 0, 1, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 1,
       1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0,
       1, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 1,
       0, 1, 0, 1, 0, 1, 1, 0, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0,
       1, 0, 1, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1, 0, 0, 1, 1, 1,
       1, 1, 1, 0, 1, 0, 1, 0, 0, 1, 1, 0, 0, 1, 1, 0, 0, 1, 0, 0, 0, 1,
       1, 1, 1, 0, 0, 0, 0, 1, 1, 0, 1, 0, 1, 1, 0, 0, 0, 1, 1, 1, 0, 1,
       0])

# Precision Ratio

In [ ]:
precision_ratio = kNN.score(test_data, test_label)
precision_ratio

0.5347432024169184

# Error

In [ ]:
error_ratio = 1 - precision_ratio
error_ratio

0.4652567975830816